InformationRegisters/ИдентификаторыПлатежныхСистем.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ИдентификаторыПлатежныхСистем</Name>
			<Comment>Идентификатор</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИдентификаторОперации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИдентификаторОплаты</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Оплата</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтатусОперации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаОперации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаОперации</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПлатежнаяСсылка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаДействияСсылки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СпособОплаты</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>НастройкаПодключения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НастройкиПодключенияКПлатежнымСистемам</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЗапросаСтатуса</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ДокументОперации</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДокументОперацииПлатежнойСистемы</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ИдентификаторыПлатежныхСистем/Ext/ManagerModule.bsl
///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2025, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

// Производит поиск идентификатора оплаты.
//
// Параметры:
//  ДокументОперации - ОпределяемыйТип.ДокументОперацииПлатежнойСистемы - документ отражающий операцию в информационной
//    базе.
//
// Возвращаемое значение:
//  Строка - идентификатор оплаты.
//  Неопределено - идентификатор оплаты не найден.
//
Функция ИдентификаторОплаты(ДокументОперации) Экспорт

	Результат = Неопределено;
	
	Запрос = Новый Запрос();
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ИдентификаторыПлатежныхСистем.ИдентификаторОплаты КАК ИдентификаторОплаты
	|ИЗ
	|	РегистрСведений.ИдентификаторыПлатежныхСистем КАК ИдентификаторыПлатежныхСистем
	|ГДЕ
	|	ИдентификаторыПлатежныхСистем.ДокументОперации = &ДокументОперации";
	
	Запрос.УстановитьПараметр("ДокументОперации", ДокументОперации);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Результат = Выборка.ИдентификаторОплаты;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Добавляет объектную и управляемую исключительную блокировку данных на запись документа операции.
// Перед вызовом метода необходимо открыть транзакцию.
//
// Параметры:
//  Блокировка - БлокировкаДанных - объект блокировки данных, куда необходимо добавить информацию о блокируемых данных.
//  ДокументОперации - ОпределяемыйТип.ДокументОперацииПлатежнойСистемы - документ, который отражает операцию в
//    информационной базе.
//
Процедура ДобавитьБлокировкуИдентификаторовПлатежнойСистемы(Блокировка, ДокументОперации) Экспорт
	
	КлючБлокировки = СоздатьКлючЗаписи(
		Новый Структура("ДокументОперации", ДокументОперации));
	ЗаблокироватьДанныеДляРедактирования(КлючБлокировки);
	
	ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.ИдентификаторыПлатежныхСистем");
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	ЭлементБлокировки.УстановитьЗначение("ДокументОперации", ДокументОперации);
	
КонецПроцедуры

// Производит поиск внутреннего идентификатора заказа, если идентификатор еще не был создан, создает новый.
//
// Параметры:
//  ДокументОперации - ОпределяемыйТип.ДокументОперацииПлатежнойСистемы - документ отражающий операцию в информационной
//    базе.
//  НастройкаПодключения - СправочникСсылка.НастройкиПодключенияКПлатежнымСистемам - настройка подключения к сервису.
//  Оплата - Булево - Истина, если тип операции "Оплата", Ложь - "Возврат".
//  ИдентификаторОплаты - Строка - идентификатор оплаты в платежной системе. Передается если известен на момент
//    проведения операции.
//    Значение по умолчанию: <Пустая строка>.
//  СоздатьНовыйИдентификатор - Булево - Истина, если необходимо создать новый идентификатор игнорируя статус операции.
//
// Возвращаемое значение:
//  Строка - внутренний идентификатор операции.
//
Функция НовыйВнутреннийИдентификаторОперации(
		ДокументОперации,
		НастройкаПодключения,
		Оплата,
		ИдентификаторОплаты = "",
		СоздатьНовыйИдентификатор = Ложь) Экспорт
	
	НачатьТранзакцию();
	Попытка
		
		Блокировка = Новый БлокировкаДанных();
		ДобавитьБлокировкуИдентификаторовПлатежнойСистемы(Блокировка, ДокументОперации);
		Блокировка.Заблокировать();
		
		Набор = СоздатьНаборЗаписей();
		Набор.Отбор.ДокументОперации.Установить(ДокументОперации);
		Набор.Прочитать();
		
		Если Набор.Количество() = 0
			Или СоздатьНовыйИдентификатор
			Или ТребуетсяГенерацияНовогоИдентификатора(Набор[0]) Тогда
			
			Результат = Строка(Новый УникальныйИдентификатор());
			Замещать = (Набор.Количество() > 0);
			
			Набор.Очистить();
			
			Запись = Набор.Добавить();
			Запись.ДокументОперации = ДокументОперации;
			Запись.Идентификатор = Результат;
			Запись.ИдентификаторОплаты = ИдентификаторОплаты;
			Запись.Оплата = Оплата;
			Запись.НастройкаПодключения = НастройкаПодключения;
			
			Набор.Записать(Замещать);
			
		Иначе
			Результат = Набор[0].Идентификатор;
		КонецЕсли;
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки;
	
	Возврат Результат;
	
КонецФункции

// Выполняет запись информации о данных операции.
//
// Параметры:
//  ДокументОперации - ОпределяемыйТип.ДокументОперацииПлатежнойСистемы - документ, который отражает операцию в
//    информационной базе.
//  ДанныеОперации - см. ПлатежныеСистемыСлужебный.НовыйОбновляемыеДанныеОперации
//
Процедура ЗаписатьДанныеОперации(ДокументОперации, ДанныеОперации) Экспорт
	
	НачатьТранзакцию();
	Попытка
		
		Блокировка = Новый БлокировкаДанных();
		ДобавитьБлокировкуИдентификаторовПлатежнойСистемы(Блокировка, ДокументОперации);
		Блокировка.Заблокировать();
		
		Набор = СоздатьНаборЗаписей();
		Набор.Отбор.ДокументОперации.Установить(ДокументОперации);
		Набор.Прочитать();
		
		Если Набор.Количество() = 0 Тогда
			ВызватьИсключение НСтр("ru = 'Информация о документе операции не найдена, невозможно записать данные.'");
		КонецЕсли;
		
		Запись = Набор[0];
		
		Для Каждого КлючИЗначение Из ДанныеОперации Цикл
			Если КлючИЗначение.Значение = Неопределено Тогда
				Продолжить;
			ИначеЕсли Запись[КлючИЗначение.Ключ] <> КлючИЗначение.Значение Тогда
				Запись[КлючИЗначение.Ключ] = КлючИЗначение.Значение;
			КонецЕсли;
		КонецЦикла;
		
		Если Набор.Модифицированность() Тогда
			
			Набор.Записать();
			
		КонецЕсли;
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		
		ОтменитьТранзакцию();
		
		ТекстИсключения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'При записи данных возникли ошибки:
				|%1'"),
			ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		
		ПлатежныеСистемыСлужебный.ЗаписатьИнформациюВЖурналРегистрации(ТекстИсключения, Истина);
		
		ВызватьИсключение ТекстИсключения;
		
	КонецПопытки;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Формирует данные операции по документу.
//
// Параметры:
//  ДокументОперации - ОпределяемыйТип.ДокументОперацииПлатежнойСистемы - документ, который отражает операцию в
//    информационной базе.
//
// Возвращаемое значение:
//  Неопределено - данные операции не найдены.
//  ВыборкаИзРезультатаЗапроса:
//    * Идентификатор - Строка - внутренний идентификатор операции.
//    * ИдентификаторОплаты - Строка - идентификатор оплаты в платежной системе.
//    * ИдентификаторОперации - Строка - идентификатор операции в платежной системе.
//    * СтатусОперации - Строка - статус операции в платежной системе.
//    * ДатаОперации - Дата - фактическая дата операции в UTC.
//    * СуммаОперации - Число - фактическая сумма операции.
//    * НастройкаПодключения - СправочникСсылка.НастройкиПодключенияКПлатежнымСистемам - настройка подключения к
//        сервису.
//    * ПлатежнаяСсылка - Строка - адрес страницы по которой выполняется оплата.
//    * ДатаДействияСсылки - Дата - дата действия платежной ссылки в UTC.
//    * СпособОплаты - Строка - способ оплаты. Доступные значения определяются методами
//        общего модуля ПлатежныеСистемыКлиентСервер.
//
Функция ДанныеОперации(ДокументОперации) Экспорт
	
	Выборка = ДанныеОпераций(ДокументОперации).Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

// Формирует данные операции по документу. В результат попадает информация только о найденных документах.
//
// Параметры:
//  ДокументыОпераций - ОпределяемыйТип.ДокументОперацииПлатежнойСистемы,
//    Массив Из ОпределяемыйТип.ДокументОперацииПлатежнойСистемы - документ или массив документов, отражающие
//    операцию в информационной базе.
//
// Возвращаемое значение:
//  РезультатЗапроса - данные операций, содержащие следующие поля:
//    * ДокументыОпераций - ОпределяемыйТип.ДокументОперацииПлатежнойСистемы - документ, отражающий
//        операцию в информационной базе.
//    * Идентификатор - Строка - внутренний идентификатор операции.
//    * ИдентификаторОплаты - Строка - идентификатор оплаты в платежной системе.
//    * ИдентификаторОперации - Строка - идентификатор операции в платежной системе.
//    * СтатусОперации - Строка - статус операции в платежной системе.
//    * ДатаОперации - Дата - фактическая дата операции в UTC.
//    * СуммаОперации - Число - фактическая сумма операции.
//    * НастройкаПодключения - СправочникСсылка.НастройкиПодключенияКПлатежнымСистемам - настройка подключения к
//        сервису.
//    * ПлатежнаяСсылка - Строка - адрес страницы по которой выполняется оплата.
//    * ДатаДействияСсылки - Дата - дата действия платежной ссылки в UTC.
//    * СпособОплаты - Строка - способ оплаты. Доступные значения определяются методами
//        общего модуля ПлатежныеСистемыКлиентСервер.
//
Функция ДанныеОпераций(ДокументыОпераций) Экспорт
	
	Запрос = Новый Запрос();
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ИдентификаторыПлатежныхСистем.ДокументОперации КАК ДокументОперации,
	|	ИдентификаторыПлатежныхСистем.Идентификатор КАК Идентификатор,
	|	ИдентификаторыПлатежныхСистем.ИдентификаторОплаты КАК ИдентификаторОплаты,
	|	ИдентификаторыПлатежныхСистем.ИдентификаторОперации КАК ИдентификаторОперации,
	|	ИдентификаторыПлатежныхСистем.СтатусОперации КАК СтатусОперации,
	|	ИдентификаторыПлатежныхСистем.ДатаОперации КАК ДатаОперации,
	|	ИдентификаторыПлатежныхСистем.СуммаОперации КАК СуммаОперации,
	|	ИдентификаторыПлатежныхСистем.НастройкаПодключения КАК НастройкаПодключения,
	|	ИдентификаторыПлатежныхСистем.ПлатежнаяСсылка КАК ПлатежнаяСсылка,
	|	ИдентификаторыПлатежныхСистем.ДатаДействияСсылки КАК ДатаДействияСсылки,
	|	ИдентификаторыПлатежныхСистем.Оплата КАК Оплата,
	|	ИдентификаторыПлатежныхСистем.СпособОплаты КАК СпособОплаты
	|ИЗ
	|	РегистрСведений.ИдентификаторыПлатежныхСистем КАК ИдентификаторыПлатежныхСистем
	|ГДЕ
	|	ИдентификаторыПлатежныхСистем.ДокументОперации В (&ДокументыОпераций)";
	
	Запрос.УстановитьПараметр("ДокументыОпераций", ДокументыОпераций);
	
	Возврат Запрос.Выполнить();
	
КонецФункции

// Получает данные для определения статуса выполнения операции в платежной системе.
//
// Параметры:
//  ДокументОперации - ОпределяемыйТип.ДокументОперацииПлатежнойСистемы - документ отражающий операцию в информационной
//    базе.
//
// Возвращаемое значение:
//  Неопределено - данные операции не найдены.
//  Структура:
//    * Идентификатор - Строка - внутренний идентификатор операции.
//    * ИдентификаторОперации - Строка - идентификатор операции в платежной системе.
//    * ИдентификаторОплаты - Строка - идентификатор оплаты в платежной системе.
//    * Оплата - Булево - Истина, если тип операции "Оплата", Ложь - "Возврат".
//    * СтатусОперации - Строка - статус операции в платежной системе.
//    * ДатаОперации - Дата - фактическая дата операции в UTC.
//    * СуммаОперации - Число - фактическая сумма операции.
//    * ДатаДействияСсылки - Дата - дата действия платежной ссылки в UTC.
//    * НастройкаПодключения - СправочникСсылка.НастройкиПодключенияКПлатежнымСистемам - настройка подключения к
//        сервису.
//    * ДатаЗапросаСтатуса - Дата - дата последней операции получения статуса в UTC.
//
Функция ПараметрыОпределенияСтатусаОперации(ДокументОперации) Экспорт
	
	Запрос = Новый Запрос();
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ИдентификаторыПлатежныхСистем.Идентификатор КАК Идентификатор,
	|	ИдентификаторыПлатежныхСистем.ИдентификаторОперации КАК ИдентификаторОперации,
	|	ИдентификаторыПлатежныхСистем.ИдентификаторОплаты КАК ИдентификаторОплаты,
	|	ИдентификаторыПлатежныхСистем.Оплата КАК Оплата,
	|	ИдентификаторыПлатежныхСистем.СтатусОперации КАК СтатусОперации,
	|	ИдентификаторыПлатежныхСистем.ДатаОперации КАК ДатаОперации,
	|	ИдентификаторыПлатежныхСистем.СуммаОперации КАК СуммаОперации,
	|	ИдентификаторыПлатежныхСистем.ДатаДействияСсылки КАК ДатаДействияСсылки,
	|	ИдентификаторыПлатежныхСистем.НастройкаПодключения КАК НастройкаПодключения,
	|	ИдентификаторыПлатежныхСистем.ДатаЗапросаСтатуса КАК ДатаЗапросаСтатуса
	|ИЗ
	|	РегистрСведений.ИдентификаторыПлатежныхСистем КАК ИдентификаторыПлатежныхСистем
	|ГДЕ
	|	ИдентификаторыПлатежныхСистем.ДокументОперации = &ДокументОперации";
	
	Запрос.УстановитьПараметр("ДокументОперации", ДокументОперации);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка;
	КонецЕсли;
	
КонецФункции

// См. ПлатежныеСистемы.УдалитьОперацию
//
Процедура УдалитьОперацию(ДокументОперации) Экспорт
	
	НачатьТранзакцию();
	Попытка
		
		Блокировка = Новый БлокировкаДанных();
		ДобавитьБлокировкуИдентификаторовПлатежнойСистемы(Блокировка, ДокументОперации);
		Блокировка.Заблокировать();
		
		Набор = СоздатьНаборЗаписей();
		Набор.Отбор.ДокументОперации.Установить(ДокументОперации);
		Набор.Записать();
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		
		ОтменитьТранзакцию();
		
		ТекстИсключения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Ошибка удаления данных операции:
				|%1'"),
			ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
		
		ПлатежныеСистемыСлужебный.ЗаписатьИнформациюВЖурналРегистрации(ТекстИсключения, Истина);
		
		ВызватьИсключение ТекстИсключения;
		
	КонецПопытки;
	
КонецПроцедуры

// Определяет необходимость создания идентификатора операции или его обновления.
//
// Параметры:
//  ДанныеОперации - РегистрСведенийЗапись.ИдентификаторыПлатежныхСистем
//
// Возвращаемое значение:
//  Булево - если Истина, необходимо создать новый идентификатор.
//
Функция ТребуетсяГенерацияНовогоИдентификатора(ДанныеОперации)
	
	// Идентификатор операции необходимо обновить если выполняется одно из условий:
	//  - внутренний идентификатор операции не заполнен;
	//  - операция находится в терминальном статусе и результат по этой операции отрицательный.
	Возврат Не ЗначениеЗаполнено(ДанныеОперации.Идентификатор)
		Или ДанныеОперации.СтатусОперации = НастройкиПлатежныхСистемКлиентСервер.СтатусОперацииОтменена();
	
КонецФункции

#КонецОбласти

#КонецЕсли
